quartet_integrations/templates/tracelink/snrequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-hudson-752-. -->
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-hudson-752-. -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="urn:tracelink:soap" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="urn:tracelink:soap" name="SerialNumberRequestService">
<types>
<xsd:schema>
<xsd:import namespace="urn:tracelink:soap" schemaLocation="{{ scheme }}://{{ host }}/soap/snx/snrequest?xsd=1"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://tracelink.com/snx" schemaLocation="{{ scheme }}://{{ host }}/soap/snx/snrequest?xsd=2"/>
</xsd:schema>
</types>
<message name="serialNumbersRequest">
<part name="parameters" element="tns:serialNumbersRequest"/>
</message>
<message name="serialNumbersRequestResponse">
<part name="parameters" element="tns:serialNumbersRequestResponse"/>
</message>
<portType name="snrequest">
<operation name="serialNumbersRequest">
<input wsam:Action="urn:tracelink:soap:snrequest:serialNumbersRequestRequest" message="tns:serialNumbersRequest"/>
<output wsam:Action="urn:tracelink:soap:snrequest:serialNumbersRequestResponse" message="tns:serialNumbersRequestResponse"/>
</operation>
</portType>
<binding name="snrequestPortBinding" type="tns:snrequest">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="serialNumbersRequest">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="SerialNumberRequestService">
<port name="snrequestPort" binding="tns:snrequestPortBinding">
<soap:address location="{{ scheme }}://{{ host }}/soap/snx/snrequest"/>
</port>
</service>
</definitions>
